# Знайти кількість парних елементів одновимірного масиву до першого
# зустрінутого числа рівного наперед заданому числу а.
#licherep Artem
import random
import numpy as np

b = int(input()) #наперед задене число
counter = 0
a=[1,2,3,4,5,6,7,8,9,0,1] # не розумів як буде провоитися введеня зроби так
s = 0
for i in range(12):
    if a[i] == b:
        s = a[:i]# коли буде яийсь елемет а ===b то на оому місці ми обрізємо масив і зупиняємо прохлд
        break
print(s)
for j in range(len(s)):
    if a[j] % 2 == 0:# перевірка на парність
        counter += 1
print(counter)
